zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_rcc.c
  * @author  MCD Application Team
  * @brief   RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Reset and Clock Control (RCC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                      ##### RCC specific features #####
  ==============================================================================
    [..]
      After reset the device is running from Internal High Speed oscillator
      (HSI 64MHz) and all peripherals are off except
      internal SRAM1, SRAM2, SRAM3 and PWR
      (+) There is no pre-scaler on High speed (AHB) and Low speed (APB) buses;
          all peripherals mapped on these buses are running at HSI speed.
      (+) The clock for all peripherals is switched off, except the SRAM

    [..]
      Once the device started from reset, the user application has to:
      (+) Configure the clock source to be used to drive the MPU, AXI and MLAHB
          (if the application needs higher frequency/performance)
      (+) Configure the AHB and APB buses pre-scalers
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the clock kernel source(s) for peripherals which clocks are not
          derived from Bus clocks

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal.h"

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup RCC RCC
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LSE_MASK (RCC_BDCR_LSEON | RCC_BDCR_LSEBYP | RCC_BDCR_DIGBYP)
#define HSE_MASK (RCC_OCENSETR_HSEON | RCC_OCENSETR_HSEBYP | RCC_OCENSETR_DIGBYP)
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCC_Private_Function_Prototypes RCC Private Functions Prototypes
  * @{
  */
HAL_StatusTypeDef RCC_AXISSConfig(const RCC_AXISSInitTypeDef *RCC_AXISSInitStruct);
HAL_StatusTypeDef RCC_MLAHBConfig(const RCC_MLAHBInitTypeDef *MLAHBInitStruct);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @defgroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
           ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      This section provides functions allowing to configure the internal/external oscillators
      (HSE, HSI, LSE,CSI, LSI) PLL, HSECSS, LSECSS and MCO and the System busses clocks (
       MPUSS,AXISS, MLAHBSS, AHB[1:4], AHB[5:6], APB1, APB2, APB3, APB4 and APB5).

    [..] Internal/external clock and PLL configuration
         (#) HSI (high-speed internal), 64 MHz factory-trimmed RC used directly or through
             the PLL as System clock source.

         (#) CSI is a low-power RC oscillator which can be used directly as system clock, peripheral
             clock, or PLL input.But even with frequency calibration, is less accurate than an
             external crystal oscillator or ceramic resonator.

         (#) LSI (low-speed internal), 32 KHz low consumption RC used as IWDG and/or RTC
             clock source.

         (#) HSE (high-speed external), 4 to 48 MHz crystal oscillator used directly or
             through the PLL as System clock source. Can be used also as RTC clock source.

         (#) LSE (low-speed external), 32 KHz oscillator used as RTC clock source.

         (#) PLL , The RCC features four independent PLLs (clocked by HSI , HSE or CSI),
             featuring three different output clocks and able  to work either in integer, Fractional or
             Spread Sprectum mode.
           (++) PLL1, which is used to provide clock to the A7 sub-system
           (++) PLL2, which is used to provide clock to the AXI sub-system, DDR and GPU
           (++) PLL3, which is used to provide clock to the MLAHB sub-system and to generate the kernel
                clock for peripherals.
           (++) PLL4, which is used to generate the kernel clock for peripherals.


         (#) HSECSS (HSE Clock security system), once enabled and if a HSE clock failure occurs
             HSECSS will generate a system reset, and protect sensitive data of the BKPSRAM

         (#) LSECSS (LSE Clock security system), once enabled and if a LSE clock failure occurs
             (++) The clock provided to the RTC is disabled immediately by the hardware
             (++) A failure event is generated (rcc_lsecss_fail). This event is connected to the TAMP
                  block, allowing to wake up from Standby, and allowing the protection of backup
                  registers and BKPSRAM
             (++) An interrupt flag (LSECSSF) is activated in order to generate an interrupt to the
                  MLAHB or MPU if needed.

         (#) MCO1 (micro controller clock output), used to output HSI, HSE, CSI,LSI or LSE clock
             (through a configurable pre-scaler).

         (#) MCO2 (micro controller clock output), used to output MPUSS, AXISS, MLAHBSS, PLL4(PLL4_P),
             HSE, or HSI clock (through a configurable pre-scaler).


