zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc.c
  /* Configure PLL4 */
  result = RCCEx_PLL4_Config(&(RCC_OscInitStruct->PLL4));
  if (result != HAL_OK)
  {
    return result;
  }

  return HAL_OK;
}


/**
  * @brief  Initializes the RCC HSE Oscillator according to the specified
  *         parameter State
  * @note   Beware HSE oscillator is not used as clock before using this function.
  *         If this is the case, you have to select another source clock for item
  *         using HSE then change the HSE state (Eg.: disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY modes.
  * @note   This function reset the CSSON bit, so if the clock security system(CSS)
  *         was previously enabled you have to enable it again after calling this
  *         function.
  * @param  State   contains the configuration for the RCC HSE Oscillator.
  *               This parameter can be one of the following values:
  *               @arg RCC_HSE_OFF: turn OFF the HSE oscillator
  *               @arg RCC_HSE_ON: turn ON the HSE oscillator using an external
  *                    crystal/ceramic resonator
  *               @arg RCC_HSE_BYPASS: HSE oscillator bypassed with external
  *                    clock using a low-swing analog signal provided to OSC_IN
  *               @arg RCC_HSE_BYPASS_DIG: HSE oscillator bypassed with external
  *                    clock using a full-swing digital signal provided to OSC_IN
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_HSEConfig(uint32_t State)
{
  uint32_t tickstart;

  /* Check parameter */
  assert_param(IS_RCC_HSE(State));

  /* Disable HSEON before configuring the HSE --------------*/
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEON);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till HSE is disabled */
  while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining bits */
  WRITE_REG(RCC->OCENCLRR, (RCC_OCENCLRR_DIGBYP | RCC_OCENSETR_HSEBYP));

  /* Enable HSE if needed ---------------------------------------*/
  if (State != RCC_HSE_OFF)
  {
    if (State == RCC_HSE_BYPASS)
    {
      SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEBYP);
    }
    else if (State == RCC_HSE_BYPASS_DIG)
    {
      SET_BIT(RCC->OCENSETR, RCC_OCENCLRR_DIGBYP);
      SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEBYP);
    }
    else
    {
      /* Do Nothing */
    }
    /* Enable oscillator */
    SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEON);

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till HSE is ready */
    while (__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initializes the RCC External Low Speed oscillator (LSE) according
  *         to the specified parameter State
  * @note   Beware LSE oscillator is not used as clock before using this function.
  *         If this is the case, you have to select another source clock for item
  *         using LSE then change the LSE state (Eg.: disable it).
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function (set PWR_CR1_DBP bit) before
  *         to configure the LSE (to be done once after reset).
  * @param  State   contains the configuration for the RCC LSE Oscillator
  *         This parameter can be one of the following values:
  *            @arg RCC_LSE_OFF: turn OFF the LSE oscillator
  *            @arg RCC_LSE_ON: turn ON the LSE oscillator using an external
  *                 crystal/ceramic resonator
  *            @arg RCC_LSE_BYPASS: LSE oscillator bypassed with external clock
  *                 using a low-swing analog signal provided to OSC32_IN
  *            @arg RCC_LSE_BYPASS_DIG: LSE oscillator bypassed with external
  *                 clock using a full-swing digital signal provided to OSC32_IN
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_LSEConfig(uint32_t State)
{
  uint32_t tickstart;

  /* Check parameter */
  assert_param(IS_RCC_LSE(State));

  /* Turning LSE off is needed before configuring */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till LSE is disabled */
  while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > LSE_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Clear remaining bits */
  CLEAR_BIT(RCC->BDCR, (RCC_BDCR_LSEBYP | RCC_BDCR_DIGBYP));

  /* Enable LSE if needed */
  if (State != RCC_LSE_OFF)
  {
    if (State == RCC_LSE_BYPASS)
    {
      SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
    }
    else if (State == RCC_LSE_BYPASS_DIG)
    {
      SET_BIT(RCC->BDCR, RCC_BDCR_DIGBYP);
      SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
    }
    else
    {
      /* Do Nothing*/
    }
    /* Enable oscillator */
    SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till LSE is ready */
    while (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > LSE_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  } /* Enable LSE if needed */

  return HAL_OK;
}

HAL_StatusTypeDef RCC_PLL1_Config(const RCC_PLLInitTypeDef *pll1)
{
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_RCC_PLL(pll1->PLLState));
  if ((pll1->PLLState) != RCC_PLL_NONE)
  {
    /* Check if the PLL is used as system clock or not (MPU, MLAHB, AXISS)*/
    if (__IS_PLL1_IN_USE() == 0U) /* If not used then */
    {
      if ((pll1->PLLState) == RCC_PLL_ON)
      {
        /* Check the parameters */
        assert_param(IS_RCC_PLLMODE(pll1->PLLMODE));
        assert_param(IS_RCC_PLL12SOURCE(pll1->PLLSource));
        assert_param(IS_RCC_PLLM1_VALUE(pll1->PLLM));
        if (pll1->PLLMODE == RCC_PLL_FRACTIONAL)
        {
          assert_param(IS_RCC_PLLN1_FRAC_VALUE(pll1->PLLN));
        }
        else
        {
          assert_param(IS_RCC_PLLN1_INT_VALUE(pll1->PLLN));
        }
        assert_param(IS_RCC_PLLP1_VALUE(pll1->PLLP));
        assert_param(IS_RCC_PLLQ1_VALUE(pll1->PLLQ));
        assert_param(IS_RCC_PLLR1_VALUE(pll1->PLLR));

