zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc.c
  Q_Div = ((RCC->PLL1CFGR2 & RCC_PLL1CFGR2_DIVQ) >> RCC_PLL1CFGR2_DIVQ_Pos) + 1U;
  Q_Freq = pll1vco / (float32_t)Q_Div;
  PLL1_Clocks->PLL1_Q_Frequency = (uint32_t)Q_Freq;

  R_Div = ((RCC->PLL1CFGR2 & RCC_PLL1CFGR2_DIVR) >> RCC_PLL1CFGR2_DIVR_Pos) + 1U;
  R_Freq = pll1vco / (float32_t)R_Div;
  PLL1_Clocks->PLL1_R_Frequency = (uint32_t)R_Freq;
}


/**
  * @brief  Returns the PLL2 clock frequencies :PLL2_P_Frequency,PLL2_R_Frequency and PLL2_Q_Frequency
  * @note   The PLL2 clock frequencies computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     The function returns values based on HSE_VALUE or HSI_VALUE Value multiplied/divided by the PLL factors.
  * @note   This function can be used by the user application to compute the
  *         baud-rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time PLL2CLK changes, this function must be called to update the
  *         right PLL2CLK value. Otherwise, any configuration based on this function will be incorrect.
  * @param  PLL2_Clocks structure.
  * @retval None
  */
__weak void HAL_RCC_GetPLL2ClockFreq(PLL2_ClocksTypeDef *PLL2_Clocks)
{
  uint32_t   pllsource;
  uint32_t   pll2m;
  uint32_t   pll2fracen;
  uint32_t   hsivalue;
  uint32_t   fracn1us;
  uint32_t   P_Div;
  uint32_t   Q_Div;
  uint32_t   R_Div;
  uint32_t   pll2vco_1;
  float32_t  fracn1;
  float32_t  pll2vco;
  float32_t  P_Freq;
  float32_t  Q_Freq;
  float32_t  R_Freq;

  pllsource = __HAL_RCC_GET_PLL12_SOURCE();
  pll2m = ((RCC->PLL2CFGR1 & RCC_PLL2CFGR1_DIVM2) >> RCC_PLL2CFGR1_DIVM2_Pos) + 1U;
  pll2fracen = (RCC->PLL2FRACR & RCC_PLL2FRACR_FRACLE) >> RCC_PLL2FRACR_FRACLE_Pos;

  fracn1us = (pll2fracen * ((RCC->PLL2FRACR & RCC_PLL2FRACR_FRACV) >> RCC_PLL2FRACR_FRACV_Pos));
  fracn1 = (float32_t)fracn1us;

  pll2vco_1 = (RCC->PLL2CFGR1 & RCC_PLL2CFGR1_DIVN) + 1U;
  pll2vco = (float32_t)pll2vco_1 + (fracn1 / (float32_t)0x2000);

  switch (pllsource)
  {
    case RCC_PLL12SOURCE_HSI:  /* HSI used as PLL clock source */
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIVRDY) != 0U)
      {
        hsivalue = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
        pll2vco *= ((float32_t)hsivalue / (float32_t)pll2m);
      }
      else
      {
        pll2vco *= ((float32_t)HSI_VALUE / (float32_t)pll2m);
      }
      break;

    case RCC_PLL12SOURCE_HSE:  /* HSE used as PLL clock source */
      pll2vco *= ((float32_t)HSE_VALUE / (float32_t)pll2m);
      break;

    case RCC_PLL12SOURCE_OFF:  /* No clock source for PLL */
      pll2vco = (float32_t)(0);
      break;

    default:
      pll2vco = (float32_t)(0);
      break;
  }

  P_Div = ((RCC->PLL2CFGR2 & RCC_PLL2CFGR2_DIVP) >> RCC_PLL2CFGR2_DIVP_Pos) + 1U;
  P_Freq = pll2vco / (float32_t)P_Div;
  PLL2_Clocks->PLL2_P_Frequency = (uint32_t)P_Freq;

  Q_Div = ((RCC->PLL2CFGR2 & RCC_PLL2CFGR2_DIVQ) >> RCC_PLL2CFGR2_DIVQ_Pos) + 1U;
  Q_Freq = pll2vco / (float32_t)Q_Div;
  PLL2_Clocks->PLL2_Q_Frequency = (uint32_t)Q_Freq;

  R_Div = ((RCC->PLL2CFGR2 & RCC_PLL2CFGR2_DIVR) >> RCC_PLL2CFGR2_DIVR_Pos) + 1U;
  R_Freq = pll2vco / (float32_t)R_Div;
  PLL2_Clocks->PLL2_R_Frequency = (uint32_t)R_Freq;
}


/**
  * @brief  Returns the PLL3 clock frequencies :PLL3_P_Frequency,PLL3_R_Frequency and PLL3_Q_Frequency
  * @note   The PLL3 clock frequencies computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note   The function returns values based on HSE_VALUE, HSI_VALUE or
  *         CSI Value multiplied/divided by the PLL factors.
  * @note   This function can be used by the user application to compute the
  *         baud-rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time PLL3CLK changes, this function must be called to update the
  *         right PLL3CLK value. Otherwise, any configuration based on this function will be incorrect.
  * @param  PLL3_Clocks structure.
  * @retval None
  */
__weak void HAL_RCC_GetPLL3ClockFreq(PLL3_ClocksTypeDef *PLL3_Clocks)
{
  uint32_t   pllsource;
  uint32_t   pll3m;
  uint32_t   pll3fracen;
  uint32_t   hsivalue;
  uint32_t   fracn1us;
  uint32_t   P_Div;
  uint32_t   Q_Div;
  uint32_t   R_Div;
  uint32_t   pll3vco_1;
  float32_t  fracn1;
  float32_t  pll3vco;
  float32_t  P_Freq;
  float32_t  Q_Freq;
  float32_t  R_Freq;

  pllsource = __HAL_RCC_GET_PLL3_SOURCE();
  pll3m = ((RCC->PLL3CFGR1 & RCC_PLL3CFGR1_DIVM3) >> RCC_PLL3CFGR1_DIVM3_Pos) + 1U;
  pll3fracen = (RCC->PLL3FRACR & RCC_PLL3FRACR_FRACLE) >> RCC_PLL3FRACR_FRACLE_Pos;

  fracn1us = (pll3fracen * ((RCC->PLL3FRACR & RCC_PLL3FRACR_FRACV) >> RCC_PLL3FRACR_FRACV_Pos));
  fracn1 = (float32_t)fracn1us;

  pll3vco_1 = ((RCC->PLL3CFGR1 & RCC_PLL3CFGR1_DIVN) + 1U);
  pll3vco = (float32_t)pll3vco_1 + (fracn1 / (float32_t)0x2000);


  switch (pllsource)
  {
    case RCC_PLL3SOURCE_HSI:  /* HSI used as PLL clock source */
      if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIVRDY) != 0U)
      {
        hsivalue = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
        pll3vco *= ((float32_t)hsivalue / (float32_t)pll3m);
      }
      else
      {
        pll3vco *= ((float32_t)HSI_VALUE / (float32_t)pll3m);
      }
      break;

    case RCC_PLL3SOURCE_HSE:  /* HSE used as PLL clock source */
      pll3vco *= ((float32_t)HSE_VALUE / (float32_t)pll3m);
      break;

    case RCC_PLL3SOURCE_CSI:  /* CSI used as PLL clock source */
      pll3vco *= ((float32_t)CSI_VALUE / (float32_t)pll3m);
      break;

    case RCC_PLL3SOURCE_OFF:  /* No clock source for PLL */
      pll3vco = (float32_t)(0);
      break;

    default:
      break;
  }

  P_Div = ((RCC->PLL3CFGR2 & RCC_PLL3CFGR2_DIVP) >> RCC_PLL3CFGR2_DIVP_Pos) + 1U;
  P_Freq = pll3vco / (float32_t)P_Div;
  PLL3_Clocks->PLL3_P_Frequency = (uint32_t)P_Freq;

  Q_Div = ((RCC->PLL3CFGR2 & RCC_PLL3CFGR2_DIVQ) >> RCC_PLL3CFGR2_DIVQ_Pos) + 1U;
  Q_Freq = pll3vco / (float32_t)Q_Div;
  PLL3_Clocks->PLL3_Q_Frequency = (uint32_t)Q_Freq;

  R_Div = ((RCC->PLL3CFGR2 & RCC_PLL3CFGR2_DIVR) >> RCC_PLL3CFGR2_DIVR_Pos) + 1U;
  R_Freq = pll3vco / (float32_t)R_Div;
  PLL3_Clocks->PLL3_R_Frequency = (uint32_t)R_Freq;
}


/**
  * @brief  Returns the PLL4 clock frequencies :PLL4_P_Frequency,PLL4_R_Frequency and PLL4_Q_Frequency
  * @note   The PLL4 clock frequencies computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note   The function returns values based on HSE_VALUE, HSI_VALUE
  *         or CSI Value multiplied/divided by the PLL factors.
  * @note   This function can be used by the user application to compute the
  *         baud-rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time PLL4CLK changes, this function must be called to update the
  *         right PLL4CLK value. Otherwise, any configuration based on this function will be incorrect.
  * @param  PLL4_Clocks structure.
  * @retval None
  */
__weak void HAL_RCC_GetPLL4ClockFreq(PLL4_ClocksTypeDef *PLL4_Clocks)
{
  uint32_t   pllsource;
  uint32_t   pll4m;
  uint32_t   pll4fracen;
  uint32_t   hsivalue;
  uint32_t   fracn1us;
  uint32_t   P_Div;
  uint32_t   Q_Div;
  uint32_t   R_Div;
  uint32_t   pll4vco_1;
  float32_t  fracn1;
  float32_t  pll4vco;
  float32_t  P_Freq;
  float32_t  Q_Freq;
  float32_t  R_Freq;

